/*********************************************************************************************************
* 模块名称：LED.c
* 摘    要：LED模块
* 当前版本：1.0.0
* 作    者：SZLY(COPYRIGHT 2018 - 2020 SZLY. All rights reserved.)
* 完成日期：2020年01月01日 
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "Bright.h"
#include "VDC.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/


static u8 gFirGetFinger = 0;    //手指脱落标志

static u16 gREDIntVal = 0;      //红光数据
static u16 gIRIntVal = 0;       //红外数据

static u16 s_iCntfingerUnstable = 0;//手指不稳定计数器（0~19）
static u16 s_iCntfingerstable = 0;  //手指稳定计数器（0~19）
static u16 s_iCntREDRoughAdj = 0;    //红光粗调计数器
static u16 s_iCntIRRoughAdj = 0;     //红外粗调计数器
static u16 s_iCntREDadjDelay = 0;    //红光调整延时计时器
static u16 s_iCntIRadjDelay = 0;     //红外调整延时计时器


static u8 REDRoughAdjFlag = 0;      //红光粗调光标志
static u8 IRRoughAdjFlag = 0;       //红外粗调光标志

static u16 REDLEDVal = 1600;           //红光led的电压值
static u16 IRLEDVal = 1400;            //红外led的电压值
/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void ResetAdj(void);

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/

static void ResetAdj(void)
{
  gFirGetFinger = 0;            // 复位重新调光后第一次检测到手指标志为0
  s_iCntfingerUnstable = 0;     // 手指不稳定标志复位值为0
  s_iCntfingerstable = 0;       // 手指稳定标志复位值为0
  s_iCntREDadjDelay = 0;        // 红光调整延时计时器
  s_iCntIRadjDelay = 0;         // 红外调整延时计时器
  s_iCntREDRoughAdj = 0;        // 红光粗调计数器
  s_iCntIRRoughAdj = 0;         // 红外粗调计数器
  
  REDLEDVal = 1600;         //初始化红外光强

  IRLEDVal = 1400;          //初始化红光光强

  
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：AdjustLED
* 函数功能：调整LED灯的亮度应用 
* 输入参数：u16*RedVal:放置红光数据的目的地址，u16*IRVal：放置红外数据的目的地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：将通过粗调和细调的LED灯电压值输出到目标地址
*********************************************************************************************************/
u16 AdjustLED(u16 num)
{
  u16 pen  = 0;
  if(num == 1)
  {
    pen=REDLEDVal;
  }
  else if(num == 0)
  {
    pen=IRLEDVal;
  }
  return(pen);
}


/*********************************************************************************************************
* 函数名称：RoughAdj
* 函数功能：手指探头检测和粗调光 
* 输入参数：u16*RedVal:红光数据地址，u16*IRVal：红外数据地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
 void RoughAdj(u16* RedVal,u16* IRVal)
{

    gREDIntVal = *RedVal;
    gIRIntVal = *IRVal;
    if(gFirGetFinger == 1)      //当检测到手指接入时
    {
      if(gREDIntVal < 100 || gIRIntVal < 100)    //若检测到手指探头脱落
      {
        s_iCntfingerUnstable++;                                         //手指不稳定计数器加一
        if(s_iCntfingerUnstable >= 10)  //10次手指脱落标志检测结束，手指探头脱落
        {
          ResetAdj();                   //复位调光函数
          gFirGetFinger = 0;     //手指探头脱落
        }
      }
      else                            //10次手指脱落标志检测结束，手指探头未脱落
      {
        s_iCntfingerUnstable = 0; //手指不稳定标志清零
        gFirGetFinger = 1;     //手指连结
        if(s_iCntfingerstable < 10)//10次手指稳定判断
        {
          s_iCntfingerstable++;
        }
        else                       //10次手指稳定判断后执行
        {
          if(REDRoughAdjFlag == 0)//红光粗调完成情况到位
          {
            if(gREDIntVal > 1300 && gREDIntVal < 1400)//红光粗调到位
            {
              s_iCntREDRoughAdj++;    //红光粗调计数器加一
              if(s_iCntREDRoughAdj >= 3)//3次红光粗调判断
              {
                REDRoughAdjFlag =0;     //红光粗调完成
              }
            }
            else                  //红光粗调粗调未完成
            {
              s_iCntREDadjDelay++;    //计数器加一
              if(s_iCntREDadjDelay >= 5)//当延时完成 
              {
                s_iCntREDadjDelay = 0;//粗调红光延时计数器清零
                if(gREDIntVal < 1300 && gREDIntVal > 100)   //如果红光光强小于600
                {
                  REDLEDVal = REDLEDVal-1;     //调整光强
                }
                else if(gREDIntVal > 1400 && gREDIntVal < 2050)
                {
                  REDLEDVal = REDLEDVal+1;
                }
//                else
//                {
//                  ResetAdj();             //重置调光函数
//                }
                s_iCntREDRoughAdj = 0;    //完成红光调光
              }     
            }
          }
//////////////////////////////////////////////////////////////////////
            if(IRRoughAdjFlag == 0)//红外粗调完成情况到位
            {
              if(gIRIntVal >1200 && gIRIntVal < 1300)//红外粗调到位
              {
                s_iCntIRRoughAdj++;    //红外粗调计数器加一
                if(s_iCntIRRoughAdj >= 3)//3次红外粗调判断
                {
                  IRRoughAdjFlag =0;     //红外粗调完成
                }
              }
              else                  //红外粗调粗调未完成
              {
                s_iCntIRadjDelay++;    //计数器加一
                if(s_iCntIRadjDelay >= 2)//当延时完成
                {
                  s_iCntIRadjDelay = 0;//粗调红外延时计数器清零
                  if(gIRIntVal < 1200 && gIRIntVal > 100)   //如果红外光强小于250
                  {
                    IRLEDVal = IRLEDVal-1;//对红外进行粗调
                  }
                  else if(gIRIntVal > 1300 && gIRIntVal < 2050)
                  {
                    IRLEDVal = IRLEDVal+1;
                  }
//                  else
//                  {
//                    ResetAdj();             //重置调光函数
//                  } 
                  s_iCntIRRoughAdj = 0;    //完成红外调光                  
                }
              }
            }
////////////////////////////////////////////////////////////////////////
          }
        }
      }
    else      //未检测到手指探头接入
    {
      if(gIRIntVal > 100 && gREDIntVal > 100)//检测到手指输入
      {
        s_iCntfingerstable = 0; //将手指稳定计数器清零
        gFirGetFinger = 1;      //检测到手指
        REDLEDVal = 1600;         //初始化红外光强

        IRLEDVal = 1400;          //初始化红光光强
      }
    }
}

