/*********************************************************************************************************
* 模块名称：SendDataToHost.c
* 摘    要：SendDataToHost模块
* 当前版本：1.0.0
* 作    者：SZLY(COPYRIGHT 2018 - 2020 SZLY. All rights reserved.)
* 完成日期：2020年01月01日 
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "SendDataToHost.h"
#include "PackUnpack.h"
#include "UART1.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
 
/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static  void  SendPackToHost(StructPackType* pPackSent);  //打包数据，并将数据发送到主机

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：SendPackToHost
* 函数功能：打包数据，并将数据发送到主机
* 输入参数：pPackSent，指向结构体变量的地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
static  void  SendPackToHost(StructPackType* pPackSent)
{
  u8  packValid = 0;  //打包正确标志位，默认值为0

  packValid = PackData(pPackSent);  //打包数据
  
  if(0 < packValid)                 //如果打包正确
  {
    WriteUART1((u8*)pPackSent, 10); //写数据到串口
  }
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitSendDataToHost
* 函数功能：初始化SendDataToHost模块 
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void  InitSendDataToHost(void)
{
  
}

/*********************************************************************************************************
* 函数名称：SendAckPack
* 函数功能：发送命令应答数据包到主机
* 输入参数：moduleId为模块ID，secondId为二级ID，ackMsg为应答消息
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void SendAckPack(u8 moduleId, u8 secondId, u8 ackMsg)
{
  StructPackType pt;  //包结构体变量

  pt.packModuleId = MODULE_SYS;   //系统信息模块的模块ID
  pt.packSecondId = DAT_CMD_ACK;  //系统信息模块的二级ID
  pt.arrData[0] = moduleId; //模块ID       
  pt.arrData[1] = secondId; //二级ID
  pt.arrData[2] = ackMsg;   //应答消息
  pt.arrData[3] = 0;  //保留
  pt.arrData[4] = 0;  //保留
  pt.arrData[5] = 0;  //保留


  SendPackToHost(&pt);//打包数据，并将数据发送到主机
}

/*********************************************************************************************************
* 函数名称：SendTempToHost
* 函数功能：发送打包好的体温数据包到主机
* 输入参数：ptempdata为储存两个通道中放大10倍的体温数据数组
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void SendTempToHost(u8* ptempdata)
{
  StructPackType pt;                //包结构体变量
  pt.packModuleId = MODULE_TEMP;    //体温信息
  pt.packSecondId = DAT_TEMP_DATA;  //体温数据
  pt.arrData[0] = ptempdata[0];     //体温探头状态      
  pt.arrData[1] = ptempdata[1];     //体温通道1高字节
  pt.arrData[2] = ptempdata[2];     //体温通道1低字节
  pt.arrData[3] = ptempdata[3];     //体温通道2高字节
  pt.arrData[4] = ptempdata[4];     //体温通道2低字节
  pt.arrData[5] = 0;                //保留

  SendPackToHost(&pt);//打包数据，并将数据发送到主机
}

/*********************************************************************************************************
* 函数名称：SendAckPack
* 函数功能：发送命令应答数据包到主机
* 输入参数：moduleId为模块ID，secondId为二级ID，ackMsg为应答消息
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void SendSpo2DataToHost(u8 Spo2state, i16 pulse, u8 Spo2)
{
  StructPackType pt;  //包结构体变量
  u8 max_pluse = 0;
  u8 min_pluse = 0;
  max_pluse = HIBYTE(pulse);
  min_pluse = LOBYTE(pulse);
  pt.packModuleId = MODULE_SPO2;   //系统信息模块的模块ID
  pt.packSecondId = DAT_SPO2_DATA;  //系统信息模块的二级ID
  pt.arrData[0] = Spo2state; //血氧饱和度信息       
  pt.arrData[1] = max_pluse; //脉率高字节
  pt.arrData[2] = min_pluse; //脉率低字节
  pt.arrData[3] = Spo2;      //血氧饱和度数据
  pt.arrData[4] = 0;  //保留
  pt.arrData[5] = 0;  //保留

  SendPackToHost(&pt);//打包数据，并将数据发送到主机
}

/*********************************************************************************************************
* 函数名称：SendSpo2WaveToHost
* 函数功能：发送打包好的波形数据包到主机，一次性发送5个点
* 输入参数：pWaveData-波形数据存放的地址，每个波形点取值范围为0～255
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void  SendSpo2WaveToHost(u8* pWaveData,u8 ProSign)
{
  StructPackType  pt; //包结构体变量
  
  pt.packModuleId = MODULE_SPO2;    //wave模块的模块ID
  pt.packSecondId = DAT_SPO2_WAVE; //wave模块的二级ID
  pt.arrData[0] = pWaveData[0]; //波形数据1
  pt.arrData[1] = pWaveData[1]; //波形数据2
  pt.arrData[2] = pWaveData[2]; //波形数据3
  pt.arrData[3] = pWaveData[3]; //波形数据4
  pt.arrData[4] = pWaveData[3]; //波形数据5
  pt.arrData[5] = ProSign;

  SendPackToHost(&pt);  //打包数据，并将数据发送到主机
}

/*********************************************************************************************************
* 函数名称：SendWaveToHost
* 函数功能：发送打包好的波形数据包到主机，一次性发送5个点
* 输入参数：pWaveData-波形数据存放的地址，每个波形点取值范围为0～255
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void  SendWaveToHost(u8* pWaveData)
{
  StructPackType  pt; //包结构体变量
  
  pt.packModuleId = MODULE_WAVE;    //wave模块的模块ID
  pt.packSecondId = DAT_WAVE_WDATA; //wave模块的二级ID
  pt.arrData[0] = pWaveData[0]; //波形数据1
  pt.arrData[1] = pWaveData[1]; //波形数据2
  pt.arrData[2] = pWaveData[2]; //波形数据3
  pt.arrData[3] = pWaveData[3]; //波形数据4
  pt.arrData[4] = pWaveData[4]; //波形数据5
  pt.arrData[5] = 0;  //保留

  SendPackToHost(&pt);  //打包数据，并将数据发送到主机
}

/*********************************************************************************************************
* 函数名称：SendEcgWaveToHost
* 函数功能：发送打包好的心电波形数据包到主机，一次性发送4个点
* 输入参数：pWaveData-波形数据存放的地址，每个波形点取值范围为0～255
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void  SendEcgWaveToHost(u8* pWaveData)
{
  StructPackType  pt; //包结构体变量
  
  pt.packModuleId = MODULE_ECG;    //ECG模块的模块ID
  pt.packSecondId = DAT_ECG_WAVE; //ECG模块的二级ID
  pt.arrData[0] = pWaveData[0]; //ECG1波形数据高字节
  pt.arrData[1] = pWaveData[1]; //ECG1波形数据低字节
  pt.arrData[2] = pWaveData[2]; //波形数据3
  pt.arrData[3] = pWaveData[3]; //波形数据4
  pt.arrData[4] = pWaveData[4]; //ECG状态
  pt.arrData[5] = 0;  //保留

  SendPackToHost(&pt);  //打包数据，并将数据发送到主机
}

/*********************************************************************************************************
* 函数名称：SendEcgLeadToHost
* 函数功能：发送打包好的心电导联数据包到主机，一次性发送2个点
* 输入参数：pWaveData-波形数据存放的地址，每个波形点取值范围为0～255
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void  SendEcgLeadToHost(u8* pWaveData)
{
  StructPackType  pt; //包结构体变量
  
  pt.packModuleId = MODULE_ECG;    //ECG模块的模块ID
  pt.packSecondId = DAT_ECG_LEAD; //ECG模块的二级ID
  pt.arrData[0] = pWaveData[0]; //导联信息
  pt.arrData[1] = pWaveData[1]; //过载报警
  pt.arrData[2] = 0;  //保留
  pt.arrData[3] = 0;  //保留
  pt.arrData[4] = 0;  //保留
  pt.arrData[5] = 0;  //保留

  SendPackToHost(&pt);  //打包数据，并将数据发送到主机
}

/*********************************************************************************************************
* 函数名称：SendEcgHrToHost
* 函数功能：发送打包好的心率数据包到主机，一次性发送2个点
* 输入参数：pWaveData-波形数据存放的地址，每个波形点取值范围为0～255
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void  SendEcgHrToHost(u8* pWaveData)
{
  StructPackType  pt; //包结构体变量
  
  pt.packModuleId = MODULE_ECG;    //ECG模块的模块ID
  pt.packSecondId = DAT_ECG_HR; //ECG模块的二级ID
  pt.arrData[0] = pWaveData[0]; //心率高字节
  pt.arrData[1] = pWaveData[1]; //心率低字节
  pt.arrData[2] = 0;  //保留
  pt.arrData[3] = 0;  //保留
  pt.arrData[4] = 0;  //保留
  pt.arrData[5] = 0;  //保留

  SendPackToHost(&pt);  //打包数据，并将数据发送到主机
}
