 /*********************************************************************************************************
* 模块名称：SendDataToHost.h
* 摘    要：SendDataToHost模块
* 当前版本：1.0.0
* 作    者：SZLY(COPYRIGHT 2018 - 2020 SZLY. All rights reserved.)
* 完成日期：2020年01月01日
* 内    容：
* 注    意：                                                                 
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef _SEND_DATA_TO_HOST_H_
#define _SEND_DATA_TO_HOST_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DataType.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void  InitSendDataToHost(void);         //初始化SendDataToHost模块
void  SendAckPack(u8 moduleId, u8 secondId, u8 ackMsg); //发送命令应答数据包

void  SendTempToHost(u8* ptempdata);    //发送打包好的体温数据包到主机
void  SendSpo2DataToHost(u8 Spo2state, i16 pulse, u8 Spo2);//发送数据包到主机
void  SendSpo2WaveToHost(u8* pWaveData,u8 ProSign);    //发送波形数据包到主机，一次性发送5个点

void  SendEcgWaveToHost(u8* pWaveData);
void  SendEcgLeadToHost(u8* pWaveData);
void  SendEcgHrToHost(u8* pWaveData);

void  SendWaveToHost(u8* pWaveData);    //发送波形数据包到主机，一次性发送5个点

#endif

